Revit 2024 API
UIView.ZoomToFit Method
 Zoom the view to fit its contents.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void ZoomToFit()
Visual Basic
Public Sub ZoomToFit
Visual C++
public:
void ZoomToFit()
See Also
UIView Class
Autodesk.Revit.UI Namespace